[FreeFireUpgrade_Bsc X2WeaponUpgradeTemplate]
FriendlyName="Hair Trigger"
FriendlyNamePlural="Hair Triggers"
BriefSummary="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGEBSC/> damage."
TinySummary="Bonus Reaction Fire Damage"
LootTooltip="This weapon upgrade, when installed, will increase a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGEBSC/>."

[FreeFireUpgrade_Adv X2WeaponUpgradeTemplate]
FriendlyName="Advanced Hair Trigger"
FriendlyNamePlural="Advanced Hair Triggers"
BriefSummary="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGEADV/> damage."
TinySummary="Bonus Reaction Fire Damage"
LootTooltip="This weapon upgrade, when installed, will increase a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGEADV/>."

[FreeFireUpgrade_Sup X2WeaponUpgradeTemplate]
FriendlyName="Superior Hair Trigger"
FriendlyNamePlural="Superior Hair Triggers"
BriefSummary="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGESUP/> damage."
TinySummary="Bonus Reaction Fire Damage"
LootTooltip="This weapon upgrade, when installed, will increase a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGESUP/>."

[HairTrigger_Bsc X2AbilityTemplate]
LocFriendlyName="Basic Hair Trigger"
LocLongDescription="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGEBSC/> damage."
LocHelpText="This weapon upgrade will increase a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGEBSC/>."

[HairTrigger_Adv X2AbilityTemplate]
LocFriendlyName="Basic Hair Trigger"
LocLongDescription="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGEADV/> damage."
LocHelpText="This weapon upgrade will increase a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGEADV/>."

[HairTrigger_Sup X2AbilityTemplate]
LocFriendlyName="Basic Hair Trigger"
LocLongDescription="Reaction Fire deals +<Ability:BONUSREACTIONFIREDAMAGESUP/> damage."
LocHelpText="This weapon upgrade will increase a soldier's damage on Reaction Fire by <Ability:BONUSREACTIONFIREDAMAGESUP/>."